load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
  defaults:
    headers:
      Content-Type: "application/x-www-form-urlencoded"

scenarios:
  - name: "Patient flow"
    flow:
      # 1. Generate a unique email and store it
      - set:
          email: "load-{{ $randomString }}@test.com"
          password: "Load@123"

      # 2. Register the user
      - post:
          url: "/auth/register"
          body:
            name: "Load Tester"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "patient"
          capture:
            # Capture the session cookie after registration (if needed)
            - json: "$.cookie"
              as: "session"
          # The registration will redirect, but we ignore the response

      # 3. Login with the same credentials
      - post:
          url: "/auth/login"
          body:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.cookie"
              as: "session"

      # 4. Visit the booking page
      - get:
          url: "/patient/appointment"
          headers:
            Cookie: "{{ session }}"

      # 5. Book an appointment
      - post:
          url: "/patient/appointment/book"
          headers:
            Cookie: "{{ session }}"
          body:
            patientName: "Load Tester"
            patientEmail: "{{ email }}"
            patientPhone: "+1234567890"
            date: "2026-12-31"
            time: "10:00"
            description: "Load test"